examples/OpenFOAM/3d_pipe/scalar_transport/0/phi
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  11
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       surfaceScalarField;
    location    "0";
    object      phi;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 3 -1 0 0 0 0];

internalField   nonuniform List<scalar> 
222000
(
3.86604e-08
5.10046e-08
4.49118e-12
5.72754e-18
3.8331e-08
3.44351e-10
-1.49448e-11
4.58786e-18
...
)
;

boundaryField
{
    inlet
    {
        type            calculated;
        value           nonuniform List<scalar> 
1500
(
-8.96694e-08
-2.02655e-07
-3.79146e-07
-6.49019e-07
-1.05445e-06
-1.65758e-06
-2.54368e-06
-3.83517e-06
...
)
;
    }
    wall
    {
        type            calculated;
        value           uniform 0;
    }
    outlet
    {
        type            calculated;
        value           nonuniform List<scalar> 
1500
(
3.68806e-08
1.41016e-07
3.07552e-07
5.66494e-07
9.60297e-07
1.55141e-06
2.42593e-06
3.70736e-06
...
)
;
    }
}


// ************************************************************************* //
